Autodesk.Revit.DB.Plumbing.PipePressureDropData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Plumbing.PipePressureDropData.KLevel
The system calculation level.
Since:
2014

Autodesk.Revit.DB.Plumbing.PipePressureDropData.CategoryId
The category id of pipe curves. It will be OST_PipeCurves, OST_FlexPipeCurves, or OST_PlaceHolderPipes.
Since:
2014

Autodesk.Revit.DB.Plumbing.PipePressureDropData.Viscosity
The viscosity of the pipe. Units: (kg/(ft·s)).
Since:
2014

Autodesk.Revit.DB.Plumbing.PipePressureDropData.Density
The density of the pipe. Units: (kg/ft³).
Since:
2014

Autodesk.Revit.DB.Plumbing.PipePressureDropData.NominalDiameter
The nominal diameter of the pipe. Units: (ft).
Since:
2014

Autodesk.Revit.DB.Plumbing.PipePressureDropData.OutsideDiameter
The outside diameter of the pipe. Units: (ft).
Since:
2014

Autodesk.Revit.DB.Plumbing.PipePressureDropData.InsideDiameter
The inside diameter of the pipe. Units: (ft).
Since:
2014

Autodesk.Revit.DB.Plumbing.PipePressureDropData.Flow
The flow of the pipe. Units: (ft³/s).
Since:
2014

Autodesk.Revit.DB.Plumbing.PipePressureDropData.Length
The length of the pipe. Units: (ft).
Since:
2014

Autodesk.Revit.DB.Plumbing.PipePressureDropData.Roughness
The roughness of the pipe. Units: (ft).
Since:
2014

Autodesk.Revit.DB.Plumbing.PipePressureDropData.PressureDrop
The pressure drop of the pipe. Units: (kg/(ft·s²)).
Since:
2014

Autodesk.Revit.DB.Plumbing.PipePressureDropData.Coefficient
The coefficient of the pipe.
Since:
2014

Autodesk.Revit.DB.Plumbing.PipePressureDropData.VelocityPressure
The velocity pressure of the pipe. Units: (kg/(ft·s²))
Since:
2014

Autodesk.Revit.DB.Plumbing.PipePressureDropData.Velocity
The velocity of the pipe. Units: (ft/s) .
Since:
2014

Autodesk.Revit.DB.Plumbing.PipePressureDropData.FrictionFactor
The friction factor of the pipe.
Since:
2014

Autodesk.Revit.DB.Plumbing.PipePressureDropData.Friction
The friction of the pipe. Units: (kg/(ft²·s²)).
Since:
2014

Autodesk.Revit.DB.Plumbing.PipePressureDropData.FlowState
The flowState of the pipe.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.Plumbing.PipePressureDropData.ReynoldsNumber
The reynolds number of the pipe.
Since:
2014

Autodesk.Revit.DB.Plumbing.PipePressureDropData.RelativeRoughness
The relative roughness of the pipe.
Since:
2014

Autodesk.Revit.DB.Plumbing.PipePressureDropData
The input and output data used by external servers for calculation of the pipe  pressure drop.
Remarks:
Roughness, Length, Flow, Diameter, Density, and Viscosity field values are input data for the calculation. ReynoldsNumber, FlowStatus, Friction, FrictionFactor, Velocity, Coefficient, and PressureDrop are output values.
Since:
2014